# Intro to Pandas

## Reindex Exercises

Import Pandas and Numpy

In [2]:
# Basic Imports

import pandas as pd
import numpy as np
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

### .reindex() method

1. Create a series from range 1 to 6 and index every value with the letter from "A" to "F".

In [3]:
# Lets create a new series
ser1 = Series([1,2,3,4],index=['A','B','C','D'])

In [4]:
# print the ser1
ser1=

A    1
B    2
C    3
D    4
dtype: int64

 2. Reindex the series and adding the letters "G" and "H"

In [5]:
# Reindex the ser1
ser2 = ser1.reindex(index=['A','B','C','D','G','H'])

In [6]:
# print the ser2
ser2

A    1.0
B    2.0
C    3.0
D    4.0
G    NaN
H    NaN
dtype: float64

3. Reindex the ser2 with the letter "Z" and fill it with the value 100.

In [9]:
# Reindex ser2
ser2=ser2.reindex(index=['A','B','C','D','G','H','Z'], fill_value=100)
ser2

A      1.0
B      2.0
C      3.0
D      4.0
G      NaN
H      NaN
Z    100.0
dtype: float64

### Reindexing rows and columns of DF

In [10]:
# Import numpy random.randn
from numpy.random import randn
randn_data = randn(20).reshape((5,4))

#Lets make a datafram ewith some random values
df1 = DataFrame(data = randn_data, index=['A','D','E','F','G'], columns=['CL1','CL2','CL3','CL4'])

#Show
df1

        CL1       CL2       CL3       CL4
A  0.640699 -0.006177 -0.250094  1.202516
D -0.904062  0.748743  0.615914  0.847730
E -0.491603 -0.627327  1.490700 -2.007773
F  0.334444  1.964098 -0.261792  0.155713
G  3.213473 -1.573144  0.402144 -1.926897

4. Use the reindex method on df1 and add the row "B"

In [13]:
# Add row B
df2=df1.reindex(index=['A','B','D','E','F','G'])
df2

        CL1       CL2       CL3       CL4
A  0.640699 -0.006177 -0.250094  1.202516
B       NaN       NaN       NaN       NaN
D -0.904062  0.748743  0.615914  0.847730
E -0.491603 -0.627327  1.490700 -2.007773
F  0.334444  1.964098 -0.261792  0.155713
G  3.213473 -1.573144  0.402144 -1.926897

5. Use the reindex method on df1 and add a new column "CL5"

In [19]:
# Add new column CL5
df2=df2.reindex(columns=['CL1','CL2','CL3','CL4','CL5'])
df2

        CL1       CL2       CL3       CL4  CL5
A  0.640699 -0.006177 -0.250094  1.202516  NaN
B       NaN       NaN       NaN       NaN  NaN
D -0.904062  0.748743  0.615914  0.847730  NaN
E -0.491603 -0.627327  1.490700 -2.007773  NaN
F  0.334444  1.964098 -0.261792  0.155713  NaN
G  3.213473 -1.573144  0.402144 -1.926897  NaN

### Rename columns

5. Use the .rename() method and rename the column of df1 to ('A1','B2','C3','D4')

In [24]:
# Rename df1 columns
df2.rename(columns= {'CL1':'A1', 'CL2':'B2','CL3':'C3','CL4':'D4','CL5':'La madonna'})

         A1        B2        C3        D4  La madonna
A  0.640699 -0.006177 -0.250094  1.202516         NaN
B       NaN       NaN       NaN       NaN         NaN
D -0.904062  0.748743  0.615914  0.847730         NaN
E -0.491603 -0.627327  1.490700 -2.007773         NaN
F  0.334444  1.964098 -0.261792  0.155713         NaN
G  3.213473 -1.573144  0.402144 -1.926897         NaN

# Congratulation! Exercises completed!